{
  "1": {
    "title": "Babu Sivadasan, Co-Founder and CEO",
    "bio": "Babu is a passionate serial entrepreneur with public company experience and an engineer at heart.<br/><br/>As a co-founder and Group President of Envestnet (NYSE:ENV), he spent 20 years building the company in various roles -  leading Products, Engineering and business functions. Prior to that, he was the co-founding CTO of Stamps.com (Nasdaq: STMP). He also serves as the Chairman of venture-funded startup Carestack.<br/><br/>He is an active angel investor and mentor to various startup companies in both Silicon Valley and India. He also serves as a venture mentor to IvyCap Venture Capital Partners.<br/><br/>He serves on the Digital IT Committee set up by the state of Kerala, India to provide IT direction to the government."
  },
  "3": {
    "title": "Bob Ward",
    "bio": "Bob is the Chief Revenue Officer for Financeware, a NewSpring Holdings company. Financeware companies include QUODD, Wealthcare, and Vertical Management Systems (VMS).<br/><br/>Bob is also the Founder and CEO of RS Advisory, which helps early-stage financial service technology providers with business and operational model development. Current and former clients include Saxon Securities, Envestnet Retirement Solutions (former Board Member), Finaconnect (former Board Member), Merriman Holdings (former Board Member) and VMS.<br/><br/>Previously, Bob was the COO for SunGard’s Wealth Management business. Prior to his Wealth Management role, Bob was the COO for the SunGard Transaction Network, which he helped grow from a start-up to one of the largest global financial services networks in the world, providing services in over 60 countries."
  },
  "8": {
    "title": "Dave Baker",
    "bio": "Dave brings over 20 years of successful sales and relationship management leadership experience with firms such as Bank of Boston, SunGard, and FIS, as well as his own sales consultancy aimed at helping growth-stage financial technology firms with their sales and go-to-market strategies.<br/><br/>Dave has extensive relationships at financial institutions ranging from the largest money center banks, down to regional banks across the country.  Moreover, he’s spent his whole career selling a variety of complex technologies to financial institutions and he uniquely understands what it takes to not only win the business but to deliver on the implementation and on-going support commitments."
  },
  "6": {
    "title": "Dino Di Palma",
    "bio": "Dino most recently served as President, Strategic Partners & Global Accounts at Avaya. In this role, Dino was responsible for the company’s go-to-market strategy across the entire portfolio of cloud and premise-based software and hardware solutions.<br/><br/>Prior to joining Avaya, Di Palma was Chief Revenue Officer at Broadsoft, leading the company’s global sales & operations. Broadsoft was acquired by Cisco late 2017 for $1.9B. He has also held leadership positions overseeing global sales and business development, customer service and support, and manufacturing operations at Benu Networks (CEO) and Acme Packet (COO & member of the founding team), prior to its acquisition by Oracle in 2013 for $2.1B.<br/><br/>Dino is also a member of G20 Ventures, which provides early traction capital for east coast enterprise startups, and is board chair of one of the G20 portfolio companies Emissary.<br/><br/><br/>Testimonial- <br/><br/>“Dino is a proven executive and visionary with deep expertise in global communications and cloud services. His years of experience have given him a unique understanding of the disruptive nature of today’s technology and how to position companies and propel them for significant growth.”<br/><br/>Michael Tessler<br/><br/>President and CEO<br/><br/>BroadSoft"
  },
  "2": {
    "title": "Hari Menon",
    "bio": "Hari is a serial entrepreneur with more than 25 years of experience with startups and large companies in the enterprise software industry, and is passionate about building and marketing enterprise software products. <br/><br/>Hari was most recently the CEO of Symphony Industrial AI, an industrial AI software company. Hari’s entrepreneurial ventures include energy management software company Sixth Dimension and internet advertising software company Tumri, which was acquired by Adobe. Hari also successfully led venture-financed supply chain SaaS company Serus through its growth and acquisition by E2Open. <br/><br/>Prior to his entrepreneurial ventures, Hari held product management and product strategy roles at Aspect Development (i2 technologies). Hari started his career in Silicon Valley as a software engineer with Consilium, Inc."
  },
  "14": {
    "title": "Jayan Chacko",
    "bio": "Jayan started his career in Software Development after graduating as an Electronics and Telecommunications Engineer in the early ‘90s. During his initial tenure with Tata Consultancy Services, he was involved in developing application platforms for diverse verticals including Airlines, Manufacturing and Banking. For over a decade, he worked in the Telecom industry with Wiltel Communications, Flag Telecom and Reliance in various capacities, developing and managing OSS/BSS systems. After a brief stint in Biotechnology, he took up the responsibility of managing the operations of Foundingminds Software, a diverse software company in the web and mobile space."
  },
  "15": {
    "title": "Jayaraj Poroor PhD, Cofounder and VP, Technology",
    "bio": "Jayaraj is an accomplished scientist and technologist with a strong track record of developing viable, strategic technologies from his directed basic research. He brings to the table a unique combination of deep systems understanding and strong mathematical thinking to craft effective and innovative solutions for hard, practical problems. He has been the principal investigator in several large research projects, resulting in numerous core technologies ranging from a real-time operating system kernel to smart devices to AI algorithms. He has been a visiting research faculty at Microsoft Research India and his research has been published in leading scientific conferences and journals. His past experience includes setting up one of the first research centres in Amrita University, founding an Industrial IoT startup, and corporate experience in India and the US. He holds a PhD in Computer Science.<br/><br/>Testimonial- <br/><br/>“I have found Jayaraj’s skills to be an excellent combination of theory and practice, and he is able to make progress collaborating across academia and industry.”<br/><br/>Dr. Sriram Rajamani<br/>Distinguished Scientist and Managing Director<br/>Microsoft Research (MSR) India Lab <br/>"
  },
  "21": {
    "title": "Joseph Thomas",
    "bio": "Joseph is a UI/UX designer with more than 16 years of experience. He began his career as an office executive and his passion for design and usability led him to defining modern user interfaces and experiences. Before co-founding Jiffy.ai, Joseph was with Envestnet, where he served as a senior UI design consultant. In this role, he helped design the UI/UX of Envestnet’s Retirement Solutions platform (ERS) and it’s financial wellness mobile app called Financial.fit.<br/><br/>Joseph is founder of the first Malayalam podcast called “M-Pod” and “Blogswara”, an early social media platform for amateur musicians to collaborate online. In 2009, he was featured in 'Connected Indians', an online initiative of Intel Technology India to spread awareness on internet adoption in India.<br/><br/>Testimonial- <br/><br/>“I had the pleasure of working closely with Joseph on putting together delightful user experiences for all our product offerings. Joseph gets UI and UX right. He is well informed on the latest UI design trends and techniques. His love and passion for art and design shine through his work.  He would always accept a challenge and deliver results with finesse. An extremely talented individual and a fantastic team player, Joseph is a delight to work with.”<br/><br/>Suma Vinod<br/>Chief Technology Officer<br/>Envestnet Retirement Solutions"
  },
  "18": {
    "title": "Rajmohan Harindranath",
    "bio": "Rajmohan is an engineer with a focus on innovation and research. He holds several patents in multiple areas, primarily focusing on telecom and mobile technologies. In his career of 20 years, he founded the startup ACT, and later became one of the initial members of Expicient Pvt Ltd. He was one of the co-founders of Option3 Pvt Limited. He is also the author of a philosophical novel, UTOPAI."
  },
  "7": {
    "title": "Sangeetha Phalgunan",
    "bio": "Sangeetha has over two decades of experience in developing business and sales strategy and accelerating partner ecosystems for software product companies, primarily in the automation market. She has significant experience building and developing sales and partner go-to-market plans for the India and APAC regions. Over the last 4 years, Sangeetha has worked with leaders in RPA & intelligent automation product companies to more fully create and broaden the intelligent automation category."
  },
  "22": {
    "title": "",
    "bio": ""
  },
  "11": {
    "title": "Allyson Burroughs",
    "bio": "Allyson is a senior marketing, communications, and digital media leader with a diverse background in strategic marketing, brand management, digital marketing, business development, internal and external corporate communications, and reputation management. Her career experiences in marketing and communications span a variety of areas, including business process services outsourcing, government healthcare marketing with a focus on US-based state Medicaid programs, marketing and advertising agencies with a focus on B2B and B2C marketing and promotions for the retail and entertainment industries, and public relations in the entertainment industry. Allyson has proven ability to build brand equity and sales pipeline through smart content strategy, seamless integration across marketing platforms, and creating meaningful digital experiences. <br/><br/>Testimonial-<br/>“Allyson’s significant success in developing marketing strategies and campaigns that generate revenue is driven by her tireless collaboration with business, marketing, and sales leaders and underpinned by her expertise, ability to build consensus, and her flexibility and resilience.”<br/><br/>Tracy Yelencsics<br/>Global Head of Marketing<br/>Conduent, Inc."
  },
  "20": {
    "title": "Ajmal Ashraf",
    "bio": "Ajmal Ashraf is a Sr. Architect in Product Development (user experience, full-stack engineering) who takes a wide view of the whole system.<br/><br/>Ajmal has worked with Envestnet (India), National Health Insurance Company (Doha), Salam Technology (Doha), and other esteemed companies on varying technical capacities to administer corporate applications and architect/develop web, mobile and intranet applications for start-ups and corporations.<br/><br/>Ajmal inherently understands that the customer is the most valued asset an organization can possess, and is driven by the unrelenting pursuit of customer-driven focus, ideals, and user experience. <br/><br/>Testimonial-<br/>“Ajmal is an expert product manager and Software Architect. He is a great collaborator, team player, technical architect, and leader, and has my highest recommendation.”<br/><br/>Yousuf Al Buhaddoud<br/>Head of International Tax Agreements, Ministry of Finance<br/>Qatar"
  },
  "4": {
    "title": "Person D",
    "bio": "Person D Text"
  },
  "5": {
    "title": "Person E",
    "bio": "Person E Text"
  },
  "9": {
    "title": "Person F",
    "bio": "Person F Text"
  },
  "10": {
    "title": "Person G",
    "bio": "Person F Text"
  },
  "12": {
    "title": "Person H",
    "bio": "Person F Text"
  },
  "13": {
    "title": "Person H",
    "bio": "Person F Text"
  },
  "16": {
    "title": "Person I",
    "bio": "Person F Text"
  },
  "17": {
    "title": "Person 21",
    "bio": "Person 21 Text"
  },
  "19": {
    "title": "Person 22",
    "bio": "Person 22 Text"
  }
}
